<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Join</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">A join is a way to combine data from two or more database tables based on a related columns between them
    <ul>Join are used when we want to query information that is distributed across multiple tables in a database and the information we need is not contained in a single table</ul><ul>By Joining tables together we can create a virtual table that conatins all of the information we need for our query</ul>Types of Joining
</div>

<img style="display: block;margin-left: auto;margin-right: auto;width: 50%;" src="./sql_images/join.png">

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Inner Join<br><br>
<ul>INNER JOIN operation is used to combine rows from two or more tables based on a related column between them. <br>The term "INNER" implies that only the records with matching values in both tables are included in the result set.</ul>
    <br><br>Syntax
    <ul>SELECT * FROM taber1</ul>
    <ul>INNER JOIN taber2</ul>
    <ul>ON table1.column = table2.column</ul
                                            <br><br>
    Also use alias
    <ul>SELECT * FROM taber1 t1</ul>
        <ul>INNER JOIN taber2 t2</ul>
        <ul>ON t1.column = t2.column</ul>

</div>

In [2]:
%load_ext sql
%sql mysql+pymysql://root:@localhost:3307/csv_data

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Table 1 membership</div>

In [5]:
%%sql 
SELECT * From membership

 * mysql+pymysql://root:***@localhost:3307/csv_data
11 rows affected.

[(1, 1, 1),
 (2, 1, 2),
 (3, 1, 3),
 (4, 1, 4),
 (5, 2, 1),
 (6, 2, 4),
 (7, 3, 1),
 (8, 3, 3),
 (9, 4, 1),
 (10, 1, 5),
 (11, 1, 6)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Table 2 users</div>

In [7]:
%%sql 
SELECT * From users

LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/csv_data
10 rows affected.

[(1, 'Bharat', 'Gujarat', 'Ahmedabad'),
 (2, 'Pearl', 'Maharashtra', 'Pune'),
 (3, 'Jahan', 'Madhya Pradesh', 'Bhopal'),
 (4, 'Divsha', 'Rajasthan', 'Jaipur'),
 (5, 'Kasheen', 'West Bengal', 'Kolkata'),
 (6, 'Hazel', 'Karnataka', 'Bangalore'),
 (7, 'Sonakshi', 'Jammu and Kashmir', 'Kashmir'),
 (8, 'Aarushi', 'Tamil Nadu', 'Chennai'),
 (9, 'Jitesh', 'Uttar Pradesh', 'Lucknow'),
 (10, 'Yogesh', 'Bihar', 'Patna')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now Focus on 1 user_id</div>

In [8]:
%%sql 
SELECT * From membership WHERE user_id = 1

 * mysql+pymysql://root:***@localhost:3307/csv_data
4 rows affected.

[(1, 1, 1), (5, 2, 1), (7, 3, 1), (9, 4, 1)]

In [10]:
%%sql 
SELECT * From users WHERE user_id = 1

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(1, 'Bharat', 'Gujarat', 'Ahmedabad')]

#### Perfom Inner Join

In [19]:
%%sql

SELECT * FROM membership t1 # just for alias
INNER JOIN users t2 # just for alias
ON t1.user_id = t2.user_id

 * mysql+pymysql://root:***@localhost:3307/csv_data
11 rows affected.

[(1, 1, 1, 1, 'Bharat', 'Gujarat', 'Ahmedabad'),
 (5, 2, 1, 1, 'Bharat', 'Gujarat', 'Ahmedabad'),
 (7, 3, 1, 1, 'Bharat', 'Gujarat', 'Ahmedabad'),
 (9, 4, 1, 1, 'Bharat', 'Gujarat', 'Ahmedabad'),
 (2, 1, 2, 2, 'Pearl', 'Maharashtra', 'Pune'),
 (3, 1, 3, 3, 'Jahan', 'Madhya Pradesh', 'Bhopal'),
 (8, 3, 3, 3, 'Jahan', 'Madhya Pradesh', 'Bhopal'),
 (4, 1, 4, 4, 'Divsha', 'Rajasthan', 'Jaipur'),
 (6, 2, 4, 4, 'Divsha', 'Rajasthan', 'Jaipur'),
 (10, 1, 5, 5, 'Kasheen', 'West Bengal', 'Kolkata'),
 (11, 1, 6, 6, 'Hazel', 'Karnataka', 'Bangalore')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here inner join merge the data on user_id those are exists in both table<ul>if any user_id are not common in both table than inner join Skip the Data</ul></div>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Left Join
    <ul>A LEFT JOIN in SQL is used to retrieve all records from the left table and the matched records from the right table.</ul>
    <ul>If there is no match in the right table, NULL values are returned for the columns from the right table.
</ul>
    Syntax<ul>SELECT * FROM taber1</ul>
    <ul>SELECT * FROM taber1</ul>
    <ul>LEFT JOIN taber2</ul>
    <ul>ON table1.column = table2.column</ul><br>
    Also use alias 
    <ul>SELECT * FROM taber1 t1</ul>
    <ul>LEFT JOIN taber2 t2</ul>
    <ul>ON t1.column = t2.colum</ul>
</div>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">TABLE 1</div>

In [46]:
%%sql
SELECT * FROM users
LIMIT 10,10

 * mysql+pymysql://root:***@localhost:3307/csv_data
10 rows affected.

[(11, 'Anita', 'Kerala ', 'Thiruvananthapuram'),
 (12, 'Shrichand', 'Punjab', 'Chandigarh'),
 (13, 'Mukesh', 'Haryana', 'Chandigarh'),
 (14, 'Vandana', 'Himachal Pradesh', 'Simla'),
 (15, 'Bhavna', 'Sikkim', 'Gangtok'),
 (16, 'Kanak', 'Goa', 'Goa'),
 (17, 'Sagar', 'Nagaland', 'Kohima'),
 (18, 'Manju', 'Andhra Pradesh', 'Hyderabad'),
 (19, 'Ramesh', 'Gujarat', 'Ahmedabad'),
 (20, 'Sarita', 'Maharashtra', 'Pune')]

In [44]:
%%sql
SELECT * FROM membership

 * mysql+pymysql://root:***@localhost:3307/csv_data
11 rows affected.

[(1, 1, 1),
 (2, 1, 2),
 (3, 1, 3),
 (4, 1, 4),
 (5, 2, 1),
 (6, 2, 4),
 (7, 3, 1),
 (8, 3, 3),
 (9, 4, 1),
 (10, 1, 5),
 (11, 1, 6)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">in table 1 the userid 12 are exits<br>but only 6 users id in table 2<br>So when i apply left join than it merge all data but if information are not exists in others table than they fill NULL values</div>

In [54]:
%%sql
SELECT * FROM users t1
LEFT JOIN membership t2
ON t1.user_id = t2.user_id

LIMIT 8,10
# here None represent the NULL values in sql

 * mysql+pymysql://root:***@localhost:3307/csv_data
10 rows affected.

[(1, 'Bharat', 'Gujarat', 'Ahmedabad', 9, 4, 1),
 (5, 'Kasheen', 'West Bengal', 'Kolkata', 10, 1, 5),
 (6, 'Hazel', 'Karnataka', 'Bangalore', 11, 1, 6),
 (7, 'Sonakshi', 'Jammu and Kashmir', 'Kashmir', None, None, None),
 (8, 'Aarushi', 'Tamil Nadu', 'Chennai', None, None, None),
 (9, 'Jitesh', 'Uttar Pradesh', 'Lucknow', None, None, None),
 (10, 'Yogesh', 'Bihar', 'Patna', None, None, None),
 (11, 'Anita', 'Kerala ', 'Thiruvananthapuram', None, None, None),
 (12, 'Shrichand', 'Punjab', 'Chandigarh', None, None, None),
 (13, 'Mukesh', 'Haryana', 'Chandigarh', None, None, None)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Note Here First Table  user are the Left Table and 2nd Table membership are Right Table</div>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">RIGHT JOIN
    <ul>A RIGHT JOIN in SQL is the opposite of a LEFT JOIN.</ul>
    <ul>It retrieves all records from the right table and the matched records from the left table.</ul>
<ul>If there is no match in the left table, NULL values are returned for the columns from the left table.</ul>
    </div>

In [58]:
%%sql
SELECT * FROM membership t1
RIGHT JOIN users t2
ON t1.user_id = t2.user_id

LIMIT 8,10
# here None represent the NULL values in sql

 * mysql+pymysql://root:***@localhost:3307/csv_data
10 rows affected.

[(9, 4, 1, 1, 'Bharat', 'Gujarat', 'Ahmedabad'),
 (10, 1, 5, 5, 'Kasheen', 'West Bengal', 'Kolkata'),
 (11, 1, 6, 6, 'Hazel', 'Karnataka', 'Bangalore'),
 (None, None, None, 7, 'Sonakshi', 'Jammu and Kashmir', 'Kashmir'),
 (None, None, None, 8, 'Aarushi', 'Tamil Nadu', 'Chennai'),
 (None, None, None, 9, 'Jitesh', 'Uttar Pradesh', 'Lucknow'),
 (None, None, None, 10, 'Yogesh', 'Bihar', 'Patna'),
 (None, None, None, 11, 'Anita', 'Kerala ', 'Thiruvananthapuram'),
 (None, None, None, 12, 'Shrichand', 'Punjab', 'Chandigarh'),
 (None, None, None, 13, 'Mukesh', 'Haryana', 'Chandigarh')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Note Here First Table membership are the Left Table and 2nd Table users are Right Table</div>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">FULL JOIN
    <ul>Note In Directly Full Join are not support in MySql</ul>
    <ul>SO use Sets Operations to perform Full Join</ul>
</div>

<hr><br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Sets
    <ul><p>A set is a data type that can store a set of distinct values, represented as a string where each value is separated by commas.<br> It is a string object with a set of values chosen from a predefined list during table creation.</p></ul>
<ul>UNION</ul>
<ul>UNION ALL</ul>
    <ul>INTERSECT</ul>
<ul>EXCEPT</ul>

</div>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">UNION
    <ul><p>UNION operator is used to combine the result sets of two or more SELECT statements into a single result set.<br>The UNION operation removes duplicate rows from the combined result set.</p>
</div>

In [60]:
%%sql 
SELECT * FROM person1

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[(1, 'Alice'), (2, 'Bob'), (3, 'Charlie')]

In [61]:
%%sql 
SELECT * FROM person2

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[(3, 'Charlie'), (4, 'David'), (5, 'Emily')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here 2 tables person1 and person2 in which have id 3 Charlie are Common
</div>

In [62]:
%%sql 
SELECT * FROM person1

UNION SELECT * FROM person2

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[(1, 'Alice'), (2, 'Bob'), (3, 'Charlie'), (4, 'David'), (5, 'Emily')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">here id 3 charlie are removed
</div>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">UNION ALL
    <ul><p>UNION ALL operator is used to combine the result sets of two or more SELECT statements into a single result set, similar to the UNION operator.<br>However, unlike UNION, UNION ALL does not remove duplicate rows from the combined result set.<br>It includes all rows, even if they are duplicates.</p>
</div>

In [64]:
%%sql 
SELECT * FROM person1

UNION ALL SELECT * FROM person2

 * mysql+pymysql://root:***@localhost:3307/csv_data
6 rows affected.

[(1, 'Alice'),
 (2, 'Bob'),
 (3, 'Charlie'),
 (3, 'Charlie'),
 (4, 'David'),
 (5, 'Emily')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">here id 3 charlie are not removed bcz i use UNION ALL</div>

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">INTERSECT
    <ul>INTERSECT operator is used to combine the result sets of two SELECT statements and return only the common rows between them.</ul>
    <ul>It effectively finds the intersection of two sets of rows, excluding any duplicates.</ul>
</div>

In [67]:
%%sql 
SELECT * FROM person1
INTERSECT SELECT * FROM person2

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(3, 'Charlie')]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">here id 3 charlie are the common value</div>

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">EXCEPT
    <ul>EXCEPT operator is used to combine the result sets of two SELECT statements and returns only the distinct rows that exist in the first set but not in the second set.</ul>
    <ul>It effectively subtracts one set of rows from another.</ul>
</div>

In [68]:
%sql SELECT * FROM person1

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[(1, 'Alice'), (2, 'Bob'), (3, 'Charlie')]

In [69]:
%sql SELECT * FROM person2

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[(3, 'Charlie'), (4, 'David'), (5, 'Emily')]

In [71]:
%%sql 
SELECT * FROM person1
EXCEPT SELECT * FROM person2

 * mysql+pymysql://root:***@localhost:3307/csv_data
2 rows affected.

[(1, 'Alice'), (2, 'Bob')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">in table 1 Alice Bob that are not in table 2 So Alice Bob are Return</div>


<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Swap Table
</div>

In [72]:
%%sql 
SELECT * FROM person2
EXCEPT SELECT * FROM person1

 * mysql+pymysql://root:***@localhost:3307/csv_data
2 rows affected.

[(4, 'David'), (5, 'Emily')]


<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">in table 1 David Emily that are not in table 2 So David Emily  are Return
</div>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">FULL JOIN
    <ul>So Now apply Full Join with the help of sets </ul>
    <ul>First Perform Left Join</ul>
        <ul>Second Perform Right Join</ul>
                <ul>Now apply UNION</ul></div>

In [84]:
%%sql
SELECT * FROM person1

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[(1, 'Alice'), (2, 'Bob'), (3, 'Charlie')]

In [85]:
%%sql
SELECT * FROM person2

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[(3, 'Charlie'), (4, 'David'), (5, 'Emily')]

- ### inner join

In [86]:
%%sql
SELECT * FROM person1
INNER JOIN person2
ON person1.id = person2.id

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(3, 'Charlie', 3, 'Charlie')]

- ### left join

In [87]:
%%sql
SELECT * FROM person1
LEFT JOIN person2
ON person1.id = person2.id

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[(3, 'Charlie', 3, 'Charlie'),
 (1, 'Alice', None, None),
 (2, 'Bob', None, None)]

- ### right join

In [89]:
%%sql
SELECT * FROM person1
RIGHT JOIN person2
ON person1.id = person2.id

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[(3, 'Charlie', 3, 'Charlie'),
 (None, None, 4, 'David'),
 (None, None, 5, 'Emily')]

- ### full join

In [97]:
%%sql

SELECT * FROM person1
LEFT JOIN person2
ON person1.id = person2.id

UNION

SELECT * FROM person1
RIGHT JOIN person2
ON person1.id = person2.id

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[(3, 'Charlie', 3, 'Charlie'),
 (1, 'Alice', None, None),
 (2, 'Bob', None, None),
 (None, None, 4, 'David'),
 (None, None, 5, 'Emily')]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">EXISTS
        <ul>EXISTS is used to determine whether a subquery returns any results.</ul>
        <ul>The condition is considered true if the subquery returns one or more rows; otherwise, it's considered false.</ul>
</div>

In [31]:
%sql SELECT * FROM person1

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[(1, 'Alice'), (2, 'Bob'), (3, 'Charlie')]

In [32]:
%sql SELECT * FROM person2

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[(3, 'Charlie'), (4, 'David'), (5, 'Emily')]

In [35]:
%%sql 
SELECT * FROM person1 t1
WHERE EXISTS(SELECT * FROM person2 t2 WHERE t1.id = t2.id)

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(3, 'Charlie')]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">NOT EXISTS
        <ul>Alternative of Exists</ul>
</div>

In [36]:
%%sql 
SELECT * FROM person1 t1
WHERE NOT EXISTS(SELECT * FROM person2 t2 WHERE t1.id = t2.id)

 * mysql+pymysql://root:***@localhost:3307/csv_data
2 rows affected.

[(1, 'Alice'), (2, 'Bob')]

<hr>
<div style="text-align:left; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Summary
<ul>INNER JOIN</ul>
<ul>LEFT JOIN</ul>
<ul>RIGHT JOIN</ul>
<ul>UNION</ul>
<ul>UNION ALL</ul>
<ul>INTERSECT</ul>
<ul>EXCEPT</ul>
<ul>FULL JOIN with UNION</ul><br>
<ul>EXISTS</ul>
<ul>NOT EXISTS</ul>

</div>